integration_tests_api.md: Convert Mermaid diagram to PlantUML
Mermaid is unreadable in dark mode.
